load-test.yml
config:
  target: 'https://gestion-equiposarea21.onrender.com'
  phases:
    - duration: 60  # Duración de la prueba en segundos
      arrivalRate: 10 # Usuarios por segundo

scenarios:
  - flow:
      - post:
          url: "/api/login"
          json:
            email: "erick.palomo@epn.edu.ec"
            password: "pruebaA@1"
          capture:
            - json: "$.token"
              as: "authToken"

      - get:
          url: "/api/equipos"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200